// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");

// Домашнее задание по семинару 4 

// Задача 25: 
//Напишите цикл, который принимает на вход два числа (A и B) 
// и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16