// 13_(С-09) 
// Семинар 9. Рекурсия

// Задача 1.
// Задать число N. Написать программу, выводящую все натуральные числа от 1 до N.
// N = 5 -> 1, 2, 3, 4, 5
// N = 6 -> 1, 2, 3, 4, 5, 6

// void ShowNumbers(int n)
// {
//     if(n >= 1)
//     {
//         ShowNumbers(n - 1);
//         System.Console.Write(n + " ");
//     }
// }

// Console.Write("Input N: ");
// int n = Convert.ToInt32(Console.ReadLine());

// ShowNumbers(n);