// Знакомство с языками программирования (семинары)
// Урок 9. Рекурсия
// <https://gb.ru/lessons/362986/homework>


// Задача 64: 
// Задайте значение N. 
// Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. 
// Выполнить с помощью рекурсии.
// N = 5 -> "5, 4, 3, 2, 1"
// N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

// void ShowReNumbers(int n)
// {
// 	if (n >= 1)
// 	{
// 		Console.Write($"{n}, "); 
// 		// престановка местами "CW" и метода для обратного порядка вывода чисел
// 		ShowReNumbers(n - 1);
// 	}
// }

// Console.Write("Input N: ");
// int n = Convert.ToInt32(Console.ReadLine());
// ShowReNumbers(n);

